HomeWork103forEDT/src/Documents/УстановкаСкидок/УстановкаСкидок.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>УстановкаСкидок</name>
  <registerRecords>InformationRegister.Скидки</registerRecords>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Скидки</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
        <types>CatalogRef.НоменклатурныеГруппы</types>
      </type>
    </attributes>
    <attributes>
      <name>Скидка</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>12</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

HomeWork103forEDT/src/Documents/УстановкаСкидок/Forms/ФормаДокумента/Module.bsl
&НаКлиенте
Процедура СкидкиНоменклатураПриИзменении(Элемент)
	
	ИзмененнаяСтрока = Элементы.Скидки.ТекущиеДанные;
	ПриИзмененииНоменклатуры(ИзмененнаяСтрока);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриИзмененииНоменклатуры(ИзмененнаяСтрока)
	Дата = Объект.Дата;
	Если ЗначениеЗаполнено(ИзмененнаяСтрока.Номенклатура) Тогда
		ИзмененнаяСтрока.Скидка = ЦеныВызовСервера.СкидкаНаДату
		(ИзмененнаяСтрока.Номенклатура,Дата);
	Иначе
		ИзмененнаяСтрока.Скидка = 0;
	КонецЕсли;
	
КонецПроцедуры
